{
  "basics": {
    "name": "M Andrew Eick",
    "label": "Mission Focus",
    "picture": "http://www.missionfocus.com/static/images/eick.jpg",
    "email": "andy@eick.me",
    "phone": "(703) 291-6720",
    "website": "http://mae.io",
    "summary": "Mark Andrew Eick is a technologist dedicated to crafting scientific innovation into practical solutions for the Intelligence Community (IC). With degrees in computer science and philosophy, he started his career in 1995 at Ford Motor Company developing systems to manage the development and printing of service manuals. The system he developed fundamentally changed the production process, improving efficiency and quality and earning him multiple technology awards.   In 2003 Mr. Eick became CTO at SSS Research, a DOD contracting startup focused on bringing new visualization techniques to thin client geospatial applications. His innovations optimizing the processing and transmission of geospatial data received multiple software patent awards and were deployed in an operational system which directly contributed to numerous successful missions.   In 2008, Mr. Eick started his own company, Mission Focus, focusing on the “Big Data” problems inherent in the IC domain. As CEO he now orchestrates technology and operations at a much larger scale, employing cloud technologies to address the storage and processing of diverse information at tremendous scale. In addition, in 2009 Mr. Eick also co-founded the Institute for Modern Intelligence, a 501(c)(3) non-profit corporation whose mission is to develop the science, practice, and governance of Intelligence at Ultra-Large scale.",
    "location": {
      "address": "100 Daingerfield Road, Suite 400",
      "postalCode": "22314",
      "city": "Alexandria",
      "countryCode": "US",
      "region": "Virginia"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Mission Focus",
      "position": "Founder and CEO",
      "website": "http://www.missionfocus.com",
      "startDate": "2008",
      "endDate": "Present",
      "summary": "MissionFocus is an agile development shop that takes domain design and development as seriously as system design and development. We work mostly in the Intelligence arena with DoD and IC customers in close partnership with the Institute for Modern Intelligence. Our core domain is the storage, processing, and utilization of data in the context of immense scale and diversity. We are experts in cloud compute and storage technology and invented the Sign Representation Framework which underpins a game-changing approach to data unification. We pride ourselves on our disciplined engineering practices and distinguish ourselves by our ability to continually learn, innovate, and deliver. The work we do is meaningful, intentional, and wrapped with our integrity. We are driven to think harder and work better than the rest because we believe the code we are writing will change the world.",
      "highlights": [
        "Won multiple IDIQ and Prime contracts",
        "Obtained GSA schedule 871 Contract",
        "Spoke at numerous conferences on Geospatial analytics and cloud technologies",
        "Developed and deployed software to both CONOS and OCONUS sites",
        "Developed and deployed cloud map/reduce analytics for mission support",
        "Member of initial accumulo development team",
        "Technical liaison to other community members on cloud technology",
        "Briefed senior civilian and military leadership.",
        "DCGS-A Data Architecture Team Lead",
        "Deputy Technical Directory for DCGS-A cloud",
        "Created Ozone Widget Framework"
      ]
    },
    {
      "company": "Institute for Modern Intelligence",
      "position": "Founder and CEO",
      "website": "http://www.imintel.org",
      "startDate": "2009",
      "endDate": "Present",
      "summary": "Developing the science, practice, and governance of Modern Intelligence. Executing the Ultra-Large Scale (ULS) systems research agenda broadly with specific application to intelligence. Developing data storage, exploration, enrichment, and exploitation solutions with a unified internet-scale dataspace operating in a cloud computing environment. ",
      "highlights": [
        "Established business and obtained 501(c)(3) non-profit status",
        "Responsible for business operations, fiduciary disclosure, and non-profit status maintenance.",
        "Established open-source licensing model for Ultra large scale cloud data framework"
      ]
    },
    {
      "company": "SSS Research",
      "position": "Chief Technology Officer",
      "website": "http://www.sss-research.com",
      "startDate": "2003",
      "endDate": "2008",
      "summary": "",
      "highlights": [
        "Led a 6 FTE team to develop and deploy a thin client collaboration and tracking application",
        "Architected AJAX geospatial framework to enable spatial awareness",
        "Negotiated and led deployment team for on-site customer installation",
        "Led a 3 phase SBIR project funded by the United States Air Force developed for National Geospatial Agency (NGA)",
        "Wrote the initial proposal and subsequent SBIR applications",
        "Led 4 person development and quality assurance team.  Defined development workflow environment, including development workflow, bug tracking system, source control repository, and agile process"
      ]
    },
    {
      "company": "Ford Motor Company",
      "position": "Software Engineer",
      "website": "",
      "startDate": "1995",
      "endDate": "2007",
      "summary": "",
      "highlights": [
        "Created, architected, and led a 15 person team in the implementation of a 7 year project to migrate the existing publishing system into an SGML / XML based publishing system",
        "Developed multilingual framework for both interface and published content installed languages are English, French, Spanish, and other European language",
        "Produced a system to analyze existing warranty data and parts data to discern instances of “over-repair”. This system resulted in $1 million in monthly savings."
      ]
    },
    {
      "company": "UNI/CARE Systems, Inc.",
      "position": "",
      "website": "",
      "startDate": "1992",
      "endDate": "1995",
      "summary": "",
      "highlights": [
        "Deployed and maintained UNIX infrastructure for networked health facilities."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Oakland University",
      "area": "Computer Science",
      "studyType": "Masters",
      "startDate": "",
      "endDate": "1995",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Western Michigan University",
      "area": "Computer Science / Philosophy",
      "studyType": "Bachelors",
      "startDate": "",
      "endDate": "1992",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Server-based systems and methods for enabling interactive, collaborative thin-and no-client image-based applications",
      "date": "Issued March 2007",
      "awarder": "US Patent: 11/688132",
      "summary": ""
    },
    {
      "title": "Analysis of time-based geospatial mashups using AD HOC visual queries",
      "date": "December 2007",
      "awarder": "US Patent: 12/005334",
      "summary": ""
    },
    {
      "title": "Systems and methods for visualizing arguments",
      "date": "January 2006",
      "awarder": "US Patent: 11/331309",
      "summary": ""
    },
    {
      "title": "Platform for real-time tracking and analysis",
      "date": "February, 2008",
      "awarder": "US Patent: 12/070976",
      "summary": ""
    },
    {
      "title": "Trade Secret",
      "date": "2005",
      "awarder": "Ford Motor Company",
      "summary": ""
    },
    {
      "title": "Vice Presidents Select Project Award",
      "date": "2006",
      "awarder": "Ford Motor Company",
      "summary": ""
    },
    {
      "title": "Most Valued Professional",
      "date": "2007-2009",
      "awarder": "Microsoft",
      "summary": "Client Application Development"
    }
  ],
  "publications": [
    {
      "name": "Big Data Happiness",
      "publisher": "SPIE.DSS Conference",
      "releaseDate": "2015-04-20",
      "website": "",
      "summary": "Innovative middle-out compression algorithm that changes the way we store data."
    },
    {
      "name": "The Conceptual Underpinnings for Ultra-Large Scale, Unified Data-space Management",
      "publisher": "Oak Ridge National Labs",
      "releaseDate": "2012/02/07",
      "website": "http://www.ornl.gov",
      "summary": ""
    },
    {
      "name": "Creating new value through effective use of Multi-Int",
      "publisher": "Defense Geospatial Intelligence",
      "releaseDate": "January, 2012",
      "website": "",
      "summary": ""
    },
    {
      "name": "",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": ""
    }
  ],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": []
}